ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32Arduino_WordClockV089/ESP32Arduino_WordClockV089.ino
    case 'q':                                                                                 // Display choice
    case 'Q':   
             sprintf(sptext,"**** Length fault Q. ****"); 
             if (InputString.length() == 1 )
               {
                Tekstprintln("  Q0= Default colour");
                Tekstprintln("  Q1= Hourly colour");
                Tekstprintln("  Q2= All white");
                Tekstprintln("  Q3= All Own colour");
                Tekstprintln("  Q4= Own colour, HETISWAS changing");
                Tekstprintln("  Q5= Wheel colour");
                Tekstprintln("  Q6= Digital display");
                Tekstprintln("  Q8= Toggle EDSOFT on/off");                
                Tekstprintln("  Q9= Toggle HET IS WAS on/off");
                sptext[0]=0;
               }
               else 
               {
                switch((byte) InputString.substring(1,2).toInt())
                 {
                  case  0:  // Default colour
                  case  1:  // Hourly colour
                  case  2:  // All white
                  case  3:  // All Own colour
                  case  4:  // Own colour, HETISWAS changing
                  case  5:  // Wheel colour                   
                  case  6:  // Digital display
                           Mem.DisplayChoice = (byte) InputString.substring(1,2).toInt();
                          if (Mem.DisplayChoice>6) Mem.DisplayChoice = 0;
                          sprintf(sptext,"Display choice: Q%d", Mem.DisplayChoice);
                          break;                                                             // Mem.DisplayChoice is OK between 0 - 6     
                  case  7: Mem.DisplayChoice = 0; break;
                  case  8: 
                          Mem.EdSoftLEDSOff = 1- Mem.EdSoftLEDSOff;
                          sprintf(sptext,"EDSOFT is %s",Mem.EdSoftLEDSOff? "OFF" : "ON");                 
                          break;      
                  case  9:
                          Mem.HetIsWasOff = 1 - Mem.HetIsWasOff;
                          sprintf(sptext,"HET IS WAS is %s",Mem.HetIsWasOff? "OFF" : "ON"); 
                          break;
                 }  
               }                     
             lastminute = 99;                                                                 // Force a minute update
             break;
    case 'R':                                                                                 // Reset to default settings 
    case 'r':
             sprintf(sptext,"**** Length fault R. ****");       
             if (InputString.equals("RRRRR"))                                                 // 
               { 
                ResetCredentials();  
                Reset();              
                ESP.restart();  
                break;
               }
             if (InputString.equals("RRR"))                                                   // 
               { 
                ResetCredentials(); 
                ESP.restart();  
                sprintf(sptext,"\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
                break;
               } 
             if (InputString.length() == 1)
               {   
                Reset();
                sprintf(sptext,"\nReset to default values: Done");
                lastminute = 99;                                                              // Force a minute update
                Displaytime();                                                                // Turn on the display with proper time
               }                                
             break;     
    case 'S':                                                                                 // Slope. factor ( 0 - 1) to multiply brighness (0 - 255) with 
    case 's':
             sprintf(sptext,"**** Length fault S. ****");    
             if (InputString.length() > 1 && InputString.length() < 5)
               {                
                Mem.LightReducer = (byte) SConstrainInt(InputString,1,1,255);
                sprintf(sptext,"Slope brightness changed to: %d%%",Mem.LightReducer);
               }
             else sprintf(sptext,"**** Input fault. \nEnter Snnn where n between 1 and 255");
             break;                     
    case 'T':
    case 't':
//                                                                                            //
             if(InputString.length() == 7)  // T125500
               {
                timeinfo.tm_hour = (int) SConstrainInt(InputString,1,3,0,23);
                timeinfo.tm_min  = (int) SConstrainInt(InputString,3,5,0,59); 
                timeinfo.tm_sec  = (int) SConstrainInt(InputString,5,7,0,59);
                if (DS3231Installed)
                  {
                   sprintf(sptext,"Time set in external RTC module");  
                   SetDS3231Time();
                   PrintDS3231Time();
                  }
                else sprintf(sptext,"No external RTC module detected");
               } 
             else sprintf(sptext,"**** Length fault. Enter Thhmmss ****");
             break;            
    case 'U':                                                                                 // factor to multiply brighness (0 - 255) with 
    case 'u':
            sprintf(sptext,"**** Length fault U. Demo mode (Unnn or U) ****");
            if (InputString.length() == 1)
               {   
                Demo = false; 
                sprintf(sptext,"Demo mode: %s",Demo?"ON":"OFF"); 
               }
            if (InputString.length() >1 && InputString.length() < 6 )
               {
                MilliSecondValue = InputString.substring(1,5).toInt();                
                Demo = true;                                                                 // Toggle Demo mode
                sprintf(sptext,"Demo mode: %s MillisecondTime=%d",Demo?"ON":"OFF", MilliSecondValue); 
               }
             break;     
    case 'W':
    case 'w':
             if (InputString.length() == 1)
               {   
                Mem.WIFIOn = 1 - Mem.WIFIOn; 
                Mem.ReconnectWIFI = 0;                                                       // Reset WIFI reconnection counter 
                Mem.NTPOn = Mem.WIFIOn;                                                      // If WIFI is off turn NTP also off
                sprintf(sptext,"WIFI is %s after restart", Mem.WIFIOn?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter W ****");
             break; 
    case 'X':
    case 'x':
             if (InputString.length() == 1)
               {   
                Mem.NTPOn = 1 - Mem.NTPOn; 
                sprintf(sptext,"NTP is %s after restart", Mem.NTPOn?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter X ****");
             break; 
    case 'Y':
    case 'y':
             Play_Lights();
             SetSecondColour();
             lastminute = 99;                                                                // Force a minute update
             Displaytime(); 
             sprintf(sptext,"**** Play Lights");     
             break;  
    case 'Z':
    case 'z':
             sprintf(sptext,"**** Start WPS on your router");   
             WiFi.onEvent(WiFiEvent);
             WiFi.mode(WIFI_STA);
             Serial.println("Starting WPS");
             wpsInitConfig();  
             wpsStart();
             break;  
//--------------------------------------------                                                //        
    case '!':                                                                                 // Print the NTP, RTC and DS3231 time
             if (InputString.length() == 1)  PrintAllClockTimes();
             break;       
    case '@':                                                                                 // Reset 
             if (InputString.length() == 1)
               {   
                Tekstprintln("\n*********\n ESP restarting\n*********\n");
                ESP.restart();   
               }                                
             else sprintf(sptext,"**** Length fault. Enter @ ****");
             break;     
    case '#':
            sprintf(sptext,"**** Length fault #. Demo mode (#nnnn or #) ****");
            if (InputString.length() == 1)
               {   
                Zelftest = 1 - Zelftest; 
                sprintf(sptext,"Zelftest: %s", Zelftest?"ON":"OFF" ); 
                Selftest();   
                Displaytime();  
               }
            if (InputString.length() >1 && InputString.length() < 6 )                        // Self test with msec delay
              {
                MilliSecondValue = InputString.substring(1,5).toInt();                
                Zelftest = 1 - Zelftest; 
                sprintf(sptext,"Zelftest: %s", Zelftest?"ON":"OFF" ); 
                Selftest(MilliSecondValue);   
                Displaytime();  
              }
             break;
             if (InputString.length() == 1)                                                    // Self test with default delay and On OFF
               {
                Zelftest = 1 - Zelftest; 
                sprintf(sptext,"Zelftest: %s", Zelftest?"ON":"OFF" ); 
                Selftest();   
                Displaytime();                                                                // Turn on the display with proper time
               }                                
             else sprintf(sptext,"**** Length fault. Enter # ****");
             break; 
    case '$':
             FireDisplay = 1 - FireDisplay;                                                   // If TestLDR = 1 LDR reading is printed every second instead every 30s
             sprintf(sptext,"FireDisplay: %s",FireDisplay? "On" : "Off");
             Displaytime();   
             break;       
    case '%':                                                                                 // SK6812 or WS2812 strip 
             if (InputString.length() == 1)
               {   
                Mem.LEDstrip = 1 - Mem.LEDstrip; 
                sprintf(sptext,"LED strip is %s after restart", Mem.LEDstrip?"WS2812":"SK6812" );
               }                                
             else sprintf(sptext,"**** Length fault . ****");
             break; 
    case '&':
             sprintf(sptext,"**** Length fault &. ****");                                     // Forced get NTP time and update the DS32RTC module
             if (InputString.length() == 1)
              {
//               NTP.getTime();                                                               // Force a NTP time update  
               SetDS3231Time();
               SetRTCTime();    
               PrintAllClockTimes();
               } 
             break;
    case '+':
             if (InputString.length() == 1)
               {   
                Mem.UseBLELongString = 1 - Mem.UseBLELongString; 
                sprintf(sptext,"Fast BLE is %s", Mem.UseBLELongString?"ON":"OFF" );
               }                                
             else sprintf(sptext,"**** Length fault. Enter + ****");
             break;         
    case '_':
             if (InputString.length() >1 && InputString.length() < 4 )                         // Self test with msec delay
              {
                byte ff = (byte) InputString.substring(1,2).toInt();    
                StoreStructInFlashMemory(); 
                sprintf(sptext,"No use: %d", ff);                                              // Update EEPROM 
                Tekstprintln(sptext);
                //ESP.restart();                                                               // Restart ESP to use the proper settings
              }
             break;    
    case '0':
    case '1':
    case '2':        
             if (InputString.length() == 6)                                                   // For compatibility input with only the time digits
              {
               timeinfo.tm_hour = (int) SConstrainInt(InputString,0,2,0,23);
               timeinfo.tm_min  = (int) SConstrainInt(InputString,2,4,0,59); 
               timeinfo.tm_sec  = (int) SConstrainInt(InputString,4,6,0,59);
               if (DS3231Installed)
                 {
                  sprintf(sptext,"Time set in external RTC module");  
                  SetDS3231Time();
                  PrintDS3231Time();
                 }
               else sprintf(sptext,"No external RTC module detected");
               } 
    default: break;
    }
   Tekstprintln(sptext); 
   StoreStructInFlashMemory();                                                                // Update EEPROM                                     
  }  
 InputString = "";
}

//--------------------------------------------                                                //
// Rotary encoder Init 
//--------------------------------------------
 void InitRotaryMod(void)
 {
 pinMode(encoderPinA,  INPUT_PULLUP);
 pinMode(encoderPinB,  INPUT_PULLUP);  
 pinMode(clearButton,  INPUT_PULLUP); 
 myEnc.write(0);                                                                              // Clear Rotary encoder buffer
 sprintf(sptext,"Rotary %s used", Mem.UseRotary==1?"IS":"NOT");
 Tekstprintln(sptext);   
 } 

//--------------------------------------------                                                //
// Keypad3x1 Init 
//--------------------------------------------
 void InitKeypad3x1(void)
 {
 digitalWrite(COLPIN,LOW);
 sprintf(sptext,"3*1 keypad %s used", Mem.UseRotary==2?"IS":"NOT");
 Tekstprintln(sptext);
 }


//--------------------------------------------                                                //
// LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin)/16;
}

// --------------------Colour Clock Light functions -----------------------------------
//--------------------------------------------                                                //
//  LED Set color for LEDs in strip and print tekst
//---------------------------------------------
void ColorLeds(char const *Tekst, int FirstLed, int LastLed, uint32_t RGBWColor)
{ 
 Stripfill(RGBWColor, FirstLed, ++LastLed - FirstLed );                                        //
 if (!NoTextInLeds && strlen(Tekst) > 0 )
     {sprintf(sptext,"%s ",Tekst); Tekstprint(sptext); }                                      // Print the text  
}
//--------------------------------------------
//  LED Set color for one LED
//--------------------------------------------
void ColorLed(int Lednr, uint32_t RGBWColor)
{   
 Stripfill(RGBWColor, Lednr, 1 );
}
//--------------------------------------------                                                //
//  LED Clear display settings of the LED's
//--------------------------------------------
void LedsOff(void) 
{ 
 Stripfill(0, 0, NUM_LEDS );                                                                  // 
}
//--------------------------------------------                                                //
// LED Turn On and Off the LED's after 200 milliseconds
//--------------------------------------------
void Laatzien(int Delaymsec) { delay(Delaymsec);Laatzien(); }
void Laatzien()
{ 
 ShowLeds();
 LedsOff(); 
 CheckDevices();                                                                              // Check for input from input devices
}

//--------------------------------------------                                                //
//  LED Push data in LED strip to commit the changes
//--------------------------------------------
void ShowLeds(void)
{
 LEDstrip.show();
}
//--------------------------------------------                                                //
//  LED Set brighness of LEDs
//--------------------------------------------
void SetBrightnessLeds(byte Bright)
{
 LEDstrip.setBrightness(Bright);                                                              // Set brightness of LEDs   
 ShowLeds();
}
//--------------------------------------------
//  LED Fill the strip array for LEDFAB library
//--------------------------------------------
void Stripfill(uint32_t RGBWColor, int FirstLed, int NoofLEDs)
{   
 LEDstrip.fill(RGBWColor, FirstLed, NoofLEDs);
}
//--------------------------------------------
//  LED Strip Get Pixel Color 
//--------------------------------------------
uint32_t StripGetPixelColor(int Lednr)
{
return(LEDstrip.getPixelColor(Lednr));
}
//--------------------------------------------                                                //
//  LED convert HSV to RGB  h is from 0-360, s,v values are 0-1
//  r,g,b values are 0-255
//--------------------------------------------
/**
 * @brief Convert HSV values to packed RGBW format (white = 0).
 * @param H Hue angle (0–360)
 * @param S Saturation (0–1)
 * @param V Value/Brightness (0–1)
 * @return Packed RGBW uint32_t value
 */
uint32_t HSVToRGB(double H, double S, double V) 
{
  int i;
  double r, g, b, f, p, q, t;
  if (S == 0)  {r = V;  g = V;  b = V; }
  else
  {
    H >= 360 ? H = 0 : H /= 60;
    i = (int) H;
    f = H - i;
    p = V * (1.0 -  S);
    q = V * (1.0 - (S * f));
    t = V * (1.0 - (S * (1.0 - f)));
    switch (i) 
    {
     case 0:  r = V;  g = t;  b = p;  break;
     case 1:  r = q;  g = V;  b = p;  break;
     case 2:  r = p;  g = V;  b = t;  break;
     case 3:  r = p;  g = q;  b = V;  break;
     case 4:  r = t;  g = p;  b = V;  break;
     default: r = V;  g = p;  b = q;  break;
    }
  }
return FuncCRGBW((int)(r*255), (int)(g*255), (int)(b*255), 0 );                                // R, G, B, W 
}
//--------------------------------------------                                                //
//  LED function to make RGBW color
//--------------------------------------------
uint32_t FuncCRGBW( uint32_t Red, uint32_t Green, uint32_t Blue, uint32_t White)
{ 
 return ( (White<<24) + (Red << 16) + (Green << 8) + Blue );
}
//--------------------------------------------                                                //
//  LED functions to extract RGBW colors
//--------------------------------------------
 uint8_t Cwhite(uint32_t c) { return (c >> 24);}
 uint8_t Cred(  uint32_t c) { return (c >> 16);}
 uint8_t Cgreen(uint32_t c) { return (c >> 8); }
 uint8_t Cblue( uint32_t c) { return (c);      }

//--------------------------------------------                                                //
//  CLOCK Set second color
//  Set the colour per second of 'IS' and 'WAS'
//---------------------------------------------
void SetSecondColour(void)
{
                             #ifdef FOURLANGUAGECLOCK
  return;                                                                                     // 4-language clock uses SetColours() once per minute
                             #endif  //FOURLANGUAGECLOCK    

 MINColor = FuncCRGBW(15 + timeinfo.tm_min * 4, 255 - timeinfo.tm_min * 4, 0, 0); 
 SECColor = FuncCRGBW(15 + timeinfo.tm_sec * 4, 255 - timeinfo.tm_sec * 4, 0, 0 );   
                                                                                              // Light up  IS or WAS with the proper colour  
 switch (Mem.DisplayChoice)
  {
   case DEFAULTCOLOUR: LetterColor = DefaultColor;                                     break; // Yellow text with changing MIN and SEC  
   case HOURLYCOLOUR : LetterColor = HourColor[timeinfo.tm_hour];                      break; // A colour every hour changing MIN and SEC
   case WHITECOLOR   : LetterColor = MINColor = SECColor = white;                      break; // All white
   case OWNCOLOUR    : LetterColor = MINColor = SECColor = Mem.OwnColour;              break; // Own colour
   case OWNHETISCLR  : LetterColor = Mem.OwnColour;                                    break; // Own colour except HET IS WAS  
   case WHEELCOLOR   : LetterColor = MINColor = SECColor = Wheel((timeinfo.tm_min*4)); break; // Colour of all letters changes per minute
   case DIGITAL      : MINColor = SECColor = 0;                                        break; // Digital display of time. No IS WAS turn color off in display
  }
 if(Mem.HetIsWasOff){MINColor = SECColor = 0;}                                                 // If HET IS WAS is turned off in menu with Q9
 NoTextInLeds  = true;                                                                        // Flag to control printing of the text IS en WAS in serial
                    #ifdef DE144CLOCK  
 if(Is) {IST;} 
 else {WAR;}                      
                    #endif  //DE144CLOCK                      
                    #if defined NL144CLOCK || defined NL92CLOCK
 if(Is) {IS;} 
 else {WAS;} 
                    #endif  //NL144CLOCK || defined NL92CLOCK
 NoTextInLeds  = false;                                                                       // Flag to control printing of the text IS en WAS in serial
 ShowLeds();                                                                                  // Updating IS and WAS with ShowLeds is done here to avoid updating all letters every second with Displaytime function
//    Serial.print("SecColor: ");    Serial.println(SECColor,HEX);  
}

