ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32Arduino_WordClockV089/ESP32Arduino_WordClockV089.ino
uint16_t XY(uint8_t x, uint8_t y) 
{  return (y % 2 == 0) ? (y * MATRIX_WIDTH + x) : (y * MATRIX_WIDTH + (MATRIX_WIDTH-1-x)); }  // Serpentine index mapping

//--------------------------------------------                                                //
// FIRE ==== Fire Logic ====
//--------------------------------------------
void Fire2023_2D() 
{
 for (uint8_t x = 0; x < MATRIX_WIDTH; x++) 
     for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) 
         heat[y][x] = clamp_sub(heat[y][x], random(0, ((COOLING*10) / MATRIX_HEIGHT) + 2));   // Step 1: Cool down
   // Step 2: Heat falls down
  for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
    for (int y = 0; y < MATRIX_HEIGHT - 2; y++) {
      heat[y][x] = (heat[y + 1][x] + heat[y + 2][x] + heat[y + 2][x]) / 3;
    }
    // Safe heat fall for second-to-top row
    heat[MATRIX_HEIGHT - 2][x] = (heat[MATRIX_HEIGHT - 1][x] + heat[MATRIX_HEIGHT - 1][x]) / 2;
  }

  // Step 3: Sparking at the top
  for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
    if (random(255) < SPARKING) {
      heat[MATRIX_HEIGHT - 1][x] = clamp_add(heat[MATRIX_HEIGHT - 1][x], random(160, 255));
    }
  }

  // Step 4: Draw pixels from heat map
  for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) {
    for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
      uint8_t r, g, b;
      HeatColor(heat[y][x], r, g, b);
      LEDstrip.setPixelColor(XY(x, y), r, g, b, 0);  // Add W=0
    }
  }
 
 
 /*
 
 for (uint8_t x = 0; x < MATRIX_WIDTH; x++) 
    {
     for (int y = MATRIX_HEIGHT - 1; y >= 2; y--) 
         heat[y][x] = (heat[y - 1][x] + heat[y - 2][x] + heat[y - 2][x]) / 3;                 // Step 2: Heat rises
     heat[1][x] = (heat[0][x] + heat[0][x]) / 2;                                              // Safe heat rise for row 1
    }

 for (uint8_t x = 0; x < MATRIX_WIDTH; x++) 
     if (random(255) < SPARKING)  heat[0][x] = clamp_add(heat[0][x], random(160, 255));       // Step 3: Sparking at the bottom row

 for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) 
    {
     for (uint8_t x = 0; x < MATRIX_WIDTH; x++) 
        {
         uint8_t r, g, b;
         HeatColor(heat[y][x], r, g, b);                                                      // Step 4: Draw the heat map to the LEDs
         LEDstrip.setPixelColor(XY(x, y), r, g, b);
        }
     }
  */   
 LEDstrip.show();
 delay(FIRE_DELAY);
}

